### Terraform Plan for Test 🔍

<details>
<summary>Show Plan</summary>

```terraform
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.app.module.cloudfront_ssr.aws_acm_certificate.cloudfront (deposed object c4d73de4) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_acm_certificate" "cloudfront" {
      - arn                       = "arn:aws:acm:us-east-1:590183702222:certificate/c2c503c5-9014-4c90-97cb-1a2ce7005f2c" -> null
      - domain_name               = "designmanual.test.vylabs.io" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "*.designmanual.test.vylabs.io"
              - resource_record_name  = "_4022db1f1cdde5508bdee585bc2fdaf5.designmanual.test.vylabs.io."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_28f38bc889c9967004e8fbc8c1aaa920.xlfgrmvvlj.acm-validations.aws."
            },
          - {
              - domain_name           = "designmanual.test.vylabs.io"
              - resource_record_name  = "_4022db1f1cdde5508bdee585bc2fdaf5.designmanual.test.vylabs.io."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_28f38bc889c9967004e8fbc8c1aaa920.xlfgrmvvlj.acm-validations.aws."
            },
        ] -> null
      - id                        = "arn:aws:acm:us-east-1:590183702222:certificate/c2c503c5-9014-4c90-97cb-1a2ce7005f2c" -> null
      - key_algorithm             = "RSA_2048" -> null
      - not_after                 = "2026-11-15T23:59:59Z" -> null
      - not_before                = "2025-10-17T00:00:00Z" -> null
      - pending_renewal           = false -> null
      - region                    = "us-east-1" -> null
      - renewal_eligibility       = "ELIGIBLE" -> null
      - renewal_summary           = [] -> null
      - status                    = "ISSUED" -> null
      - subject_alternative_names = [
          - "*.designmanual.test.vylabs.io",
          - "designmanual.test.vylabs.io",
        ] -> null
      - tags                      = {} -> null
      - tags_all                  = {
          - "application" = "digitalekanaler-designmanual"
          - "repo"        = "spor"
          - "terraform"   = "true"
        } -> null
      - type                      = "AMAZON_ISSUED" -> null
      - validation_emails         = [] -> null
      - validation_method         = "DNS" -> null
        # (2 unchanged attributes hidden)

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
          - export                                      = "DISABLED" -> null
        }
    }

  # module.app.module.cloudfront_ssr.aws_acm_certificate_validation.cloudfront will be created
  + resource "aws_acm_certificate_validation" "cloudfront" {
      + certificate_arn         = "arn:aws:acm:us-east-1:590183702222:certificate/d45a33c3-f2fc-4f14-ba79-ae4d50ecd6a6"
      + id                      = (known after apply)
      + region                  = "us-east-1"
      + validation_record_fqdns = [
          + "_4022db1f1cdde5508bdee585bc2fdaf5.designmanual.test.vylabs.io",
          + "_e7b55039e0702e531407d3f2bff9ab72.test.design.vy.no.test.vylabs.io",
        ]

      + timeouts {
          + create = "45m"
        }
    }

  # module.app.module.cloudfront_ssr.aws_cloudfront_distribution.this will be updated in-place
  ~ resource "aws_cloudfront_distribution" "this" {
      ~ aliases                         = [
          + "test.design.vy.no",
            # (2 unchanged elements hidden)
        ]
        id                              = "E2X66A4CTR5YKV"
        tags                            = {}
        # (23 unchanged attributes hidden)

      ~ viewer_certificate {
          ~ acm_certificate_arn            = "arn:aws:acm:us-east-1:590183702222:certificate/c2c503c5-9014-4c90-97cb-1a2ce7005f2c" -> "arn:aws:acm:us-east-1:590183702222:certificate/d45a33c3-f2fc-4f14-ba79-ae4d50ecd6a6"
            # (4 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.app.module.cloudfront_ssr.aws_route53_record.cloudfront_alias["test.design.vy.no"] will be created
  + resource "aws_route53_record" "cloudfront_alias" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "test.design.vy.no"
      + type            = "A"
      + zone_id         = "Z040766361YOSZ9Z30XK"

      + alias {
          + evaluate_target_health = false
          + name                   = "d3mi77z9vg0s3t.cloudfront.net"
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

Plan: 2 to add, 1 to change, 1 to destroy.

Warning: Redundant ignore_changes element

  on .terraform/modules/app.preview_url/main.tf line 111, in resource "aws_lambda_function" "lambda_function":
 111: resource "aws_lambda_function" "lambda_function" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute qualified_arn is decided by the provider alone and therefore
there can be no configured value to compare with. Including this attribute in
ignore_changes has no effect. Remove the attribute from ignore_changes to
quiet this warning.

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*For commit 8e04231763f6e7ef4b96be3b4f13d91792b42e5f*
*Plan generated at: 2025-10-21 15:07:12 UTC*
